2F/Operating_Systems/Lab-7/docs.tex
% Created 2023-10-29 Sun 20:08
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{placeins}
\usepackage{gensymb}
\author{Christian}
\date{\today}
\title{homework.c}
\hypersetup{
 pdfauthor={Christian},
 pdftitle={homework.c},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2.50 (Org mode 9.7-pre)}, 
 pdflang={English}}
\begin{document}

\section{NAME}
\label{sec:orga630cdb}
homework - Process and print the contents of a file line by line.
\section{SYNOPSIS}
\label{sec:orge87051a}
\textbf{\textbf{homework}} [OPTIONS] File
\section{DESCRIPTION}
\label{sec:org6b50d55}
The \textbf{\textbf{homework}} program reads the contents of an input file and prints each line to standard output. It provides options to reverse each line, introduce a delay between lines, and log the status of the program.
\section{OPTIONS}
\label{sec:org0ccb5ac}
-h
  Display this help message.

-r
  Reverse each line before printing.

-d [delay]
  Specify a delay in seconds or fractions thereof. For example, -d 0.5 introduces a 500 milliseconds delay.

-H
  Print an HTTP response header (for use with web servers).

-p
  Process input files in parallel.

-L [logfile]
  Log the status of the program to a specified logfile.
\section{EXAMPLES}
\label{sec:org0e6ec91}
Process a file in reverse with a 1-second delay:
\begin{verbatim}
homework -r -d 1 file.txt
\end{verbatim}

Process a file in parallel with logging:
\begin{verbatim}
homework -p -L logfile.txt file1.txt file2.txt
\end{verbatim}
\section{SEE ALSO}
\label{sec:org75279f5}
\begin{itemize}
\item\relax [getopt(3)](\url{https://man7.org/linux/man-pages/man3/getopt.3.html})
\item\relax [fork(2)](\url{https://man7.org/linux/man-pages/man2/fork.2.html})
\end{itemize}
\end{document}